In [1]:
import pandas as pd
# pandas kütüphanesini pd kısaltmasıyla projeye dahil eder.

In [2]:
# df --> dataframe demektir. sanal bir excel tablosu gibidir. yani ham dataya yani excel tutulan veri bozulmaz. 
# read_csv ile datayı çekiyoruz.
df = pd.read_csv(filepath_or_buffer='data/categories.csv') # filepath_or_buffer argümanı ise veri setimizin yolunu yazmak için kullanıyoruz.
df.head() # head fonksiyonu default olarak ilk 5 satırı yazdırıyoruz.

,CategoryID,CategoryName,Description
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales"
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an..."
2,3,Confections,"Desserts, candies, and sweet breads"
3,4,Dairy Products,Cheeses
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal"

In [3]:
# Harf getirme işlemi
# # from string import ascii_lowercase

# asci_lowercase fonksiyonu bize küçük harf halinde a, b, c .... z bize teslim edecek.
# output --> 'abcdefghijklmnopqrstuvwxyz'
# bu kod---> list(ascii_lowercase[:len(df)]) bize 'abcdefgh' bu ifadeyi verir.
# veri setinin 0, 1, 2, 3 ... 8 olan index bilgilerini a, b, c, ... h yapar.
# df.index = list(ascii_lowercase[:len(df)])

In [4]:
# veri setimiz kaç satırdan ve sütundan oluştuğunu gösterir.
df.shape # satır ve sütun

(8, 3)

In [5]:
# veri setimizde ki verilerin tipini ekrana yazdırır. Data tipini kontrol eder.
df.dtypes

CategoryID       int64
CategoryName    object
Description     object
dtype: object

In [6]:
# Tek sütünu pandas serisi olarak seçer.
df['CategoryName']

0         Beverages
1        Condiments
2       Confections
3    Dairy Products
4    Grains/Cereals
5      Meat/Poultry
6           Produce
7           Seafood
Name: CategoryName, dtype: object

In [7]:
# Tek sütünu dataframe olarak seçer.
df[['CategoryName']]

     CategoryName
0       Beverages
1      Condiments
2     Confections
3  Dairy Products
4  Grains/Cereals
5    Meat/Poultry
6         Produce
7         Seafood

## Select

#### Python'da iki tip selector bulumaktadır:

+ <b>loc:</b> Pandas kütüphanesinde veri seçmek için kullanılan çok güçlü bir yöntemdir. Özellikle <i>etiket</i> yani satır ve sütun isimlerini üzerinden nokta atışı veri seçimi yani select işlemi yapılır. "loc" etiket bazlı selection yapar.

+ <b>iloc:</b> Pandas kütüphanesinde veri seçmek için kullanılır. "loc" farkı ise "iloc" <i>pozisyona</i> göre seçim yapar yani satır numarası ve sütun numarası üzerinden işlem yapar. "iloc" integer bazlı yani satır ve sütun numarasına göre.

<hr>

<b>Dilimleme: </b> <i>Hem "loc" hemde "iloc" ile tıpkı python'da ki gibi dilimleme yapılabilinir.</i>

In [8]:
# loc example
# loc içerisinde ilk kullanılan ifade:
#  ":" --> bütün satırlar demek
# 'CategoryName' --> seçilmek istenilen sütunu ifade eder.
# o halde "loc" kullanımında ilk argüman satır ikinci argüman sütunu temsil eder
# df.loc['satır etiketi', 'sütun etiketi']
df.loc[:, 'CategoryName']

0         Beverages
1        Condiments
2       Confections
3    Dairy Products
4    Grains/Cereals
5      Meat/Poultry
6           Produce
7           Seafood
Name: CategoryName, dtype: object

In [9]:
# Seafood verisini loc kullanarak getirelim
df.loc[7, 'CategoryName']

'Seafood'

In [10]:
# Dairy Products, Grains/Cereals, Meat/Poultry verilerini loc kullanarak getirelim
df.loc[3:5, 'CategoryName']

3    Dairy Products
4    Grains/Cereals
5      Meat/Poultry
Name: CategoryName, dtype: object

In [11]:
# Dataframe olarak (loc) belirli bir satırıdaki tüm veriyi getirir
df.loc[[3]]

   CategoryID    CategoryName Description
3           4  Dairy Products     Cheeses

In [12]:
# Pandas serisi olarak (loc) belirli bir satırıdaki tüm veriyi getirir
df.loc[3]

CategoryID                   4
CategoryName    Dairy Products
Description            Cheeses
Name: 3, dtype: object

In [13]:
# 0 ve 7 satır ile CategoryName, Description satırlarını getirir
df.loc[[0, 7], ['CategoryName', 'Description']]

  CategoryName                                  Description
0    Beverages  Soft drinks, coffees, teas, beers, and ales
7      Seafood                             Seaweed and fish

In [14]:
# 0 ile 3 satırlar ile CategoryID, CategoryName sütunlarını listeler
df.loc[0:3, ['CategoryID', 'CategoryName']]

   CategoryID    CategoryName
0           1       Beverages
1           2      Condiments
2           3     Confections
3           4  Dairy Products

In [15]:
# CategoryName, CategoryID ve Description sutunların tüm satırlarını listeler
df.loc[:, ['CategoryName', 'CategoryID', 'Description']]

,CategoryName,CategoryID,Description
0,Beverages,1,"Soft drinks, coffees, teas, beers, and ales"
1,Condiments,2,"Sweet and savory sauces, relishes, spreads, an..."
2,Confections,3,"Desserts, candies, and sweet breads"
3,Dairy Products,4,Cheeses
4,Grains/Cereals,5,"Breads, crackers, pasta, and cereal"
5,Meat/Poultry,6,Prepared meats
6,Produce,7,Dried fruit and bean curd
7,Seafood,8,Seaweed and fish

In [16]:
# iloc kullanarak bana 7 satırın CategoryName getirelim. 
df.iloc[7, 1]

'Seafood'

In [17]:
# 1. ve 3. satırları arası CategoryName getirelim.
df.iloc[1:3, 1]

1     Condiments
2    Confections
Name: CategoryName, dtype: object

In [18]:
# sadece 1. ve 7. satıları, CategoryName ve Description sütunlarını getirelim
df.iloc[[1, 7], [1, 2]]

  CategoryName                                        Description
1   Condiments  Sweet and savory sauces, relishes, spreads, an...
7      Seafood                                   Seaweed and fish

In [19]:
# Şimdi başka bir data çekip loc ve iloc örnekleri yapalım
# read_csv() ile datayı çekelim
# df.head() # listedeki ilk 5 sıralamasını yaptık
df = pd.read_csv(filepath_or_buffer='data/nba.csv') 
# df.head(1) # () içine örneğin 1 yazarsak 1. satırı çeker
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,2-Jun,180,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette,6796117.0
2,John Holland,Boston Celtics,30,SG,27,5-Jun,205,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28,SG,22,5-Jun,185,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8,PF,29,10-Jun,231,NaN,5000000.0

In [20]:
from itertools import product
from string import ascii_lowercase
# itertools.product ve string.ascii_lowercase, tüm küçük harflerin (a-z) olası kombinasyonlarını üretmek için kullanılır.

def get_labels(n):
    for size in range(1, 5):  # 1'den 4 harfe kadar
        for p in product(ascii_lowercase, repeat=size):
            yield ''.join(p)
            n -= 1
            if n == 0:
                return

df.index = list(get_labels(len(df)))
print(df)

             Name            Team  Number Position  Age  Height  Weight  \
a   Avery Bradley  Boston Celtics       0       PG   25   2-Jun     180
b     Jae Crowder  Boston Celtics      99       SF   25   6-Jun     235
c    John Holland  Boston Celtics      30       SG   27   5-Jun     205
d     R.J. Hunter  Boston Celtics      28       SG   22   5-Jun     185
e   Jonas Jerebko  Boston Celtics       8       PF   29  10-Jun     231
..            ...             ...     ...      ...  ...     ...     ...
qk     Trey Lyles       Utah Jazz      41       PF   20  10-Jun     234
ql   Shelvin Mack       Utah Jazz       8       PG   26   3-Jun     203
qm      Raul Neto       Utah Jazz      25       PG   24   1-Jun     179
qn   Tibor Pleiss       Utah Jazz      21        C   26   3-Jul     256
qo    Jeff Withey       Utah Jazz      24        C   26  Jul-00     231

              College     Salary
a               Texas  7730337.0
b           Marquette  6796117.0
c   Boston University        NaN
d       Georgia State  1148640.0
e                 NaN  5000000.0
..                ...        ...
qk           Kentucky  2239800.0
ql             Butler  2433333.0
qm                NaN   900000.0
qn                NaN  2900000.0
qo             Kansas   947276.0

[457 rows x 9 columns]

# Harfli İndeks Atama Fonksiyonu

Bu fonksiyon, pandas DataFrame gibi veri yapılarında satır veya sütun indekslerini  
Excel'deki sütun isimlendirmesine benzer şekilde harf bazlı indekslere dönüştürmek için kullanılır.

---

## Neden Kullanılır?

- Büyük veri setlerinde indeksleri harflerle ifade etmek isteyebilirsiniz.
- Özellikle veri görselleştirme veya özel indeksleme yaparken kolaylık sağlar.
- `0, 1, 2...` yerine `a, b, c...` ve devamında `aa, ab, ac...` gibi okunabilir etiketler üretir.

---

## Fonksiyonun Çalışma Mantığı

- `itertools.product` kullanarak 1 ila 4 harf uzunluğunda tüm olası kombinasyonları üretir.
- İstenilen `n` adet etiket oluşturulana kadar üretimi sürdürür.
- Örneğin, `n=30` ise:  
  `a, b, c, ..., z, aa, ab, ac` şeklinde 30 adet harfli indeks üretir.

---

## Kullanım

```python
from itertools import product
from string import ascii_lowercase

def get_labels(n):
    """
    Verilen sayı kadar Excel tarzı harfli etiket üretir.
    Örnek çıktı: a, b, c, ..., z, aa, ab, ac, ...

    Parametreler:
    -----------
    n : int
        Üretilecek etiket sayısı.

    Yields:
    -------
    str
        Harflerden oluşan bir etiket.
    """
    for size in range(1, 5):  # 1 ila 4 harf uzunluğunda kombinasyonlar
        for p in product(ascii_lowercase, repeat=size):
            yield ''.join(p)
            n -= 1
            if n == 0:
                return

# Örnek: DataFrame satır sayısı kadar indeks oluşturma
df.index = list(get_labels(len(df)))

In [21]:
# veri setimiz kaç satırdan ve sütundan oluştuğunu gösterir.
df.shape # satır ve sütun

(457, 9)

In [22]:
# veri setimizde ki verilerin tipini ekrana yazdırır. Data tipini kontrol eder.
df.dtypes

Name         object
Team         object
Number        int64
Position     object
Age           int64
Height       object
Weight        int64
College      object
Salary      float64
dtype: object

In [23]:
# Tek sütünu pandas serisi olarak seçer.
df['Name'] # Satırlara Sayı yerine harf atadık.

a     Avery Bradley
b       Jae Crowder
c      John Holland
d       R.J. Hunter
e     Jonas Jerebko
          ...
qk       Trey Lyles
ql     Shelvin Mack
qm        Raul Neto
qn     Tibor Pleiss
qo      Jeff Withey
Name: Name, Length: 457, dtype: object

In [24]:
# Tek sütünu dataframe olarak seçer.
df[['Name']] # Satırlara Sayı yerine harf atadık.

             Name
a   Avery Bradley
b     Jae Crowder
c    John Holland
d     R.J. Hunter
e   Jonas Jerebko
..            ...
qk     Trey Lyles
ql   Shelvin Mack
qm      Raul Neto
qn   Tibor Pleiss
qo    Jeff Withey

[457 rows x 1 columns]

In [25]:
df.head() # Rakamlar yerine harfleri atadık.

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
a,Avery Bradley,Boston Celtics,0,PG,25,2-Jun,180,Texas,7730337.0
b,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette,6796117.0
c,John Holland,Boston Celtics,30,SG,27,5-Jun,205,Boston University,NaN
d,R.J. Hunter,Boston Celtics,28,SG,22,5-Jun,185,Georgia State,1148640.0
e,Jonas Jerebko,Boston Celtics,8,PF,29,10-Jun,231,NaN,5000000.0

# loc ve iloc örnekleri yapalım

In [26]:
# loc örneği ile oyuncuların Name ve Team getirelim
df.loc[:, ['Name', 'Team']]

             Name            Team
a   Avery Bradley  Boston Celtics
b     Jae Crowder  Boston Celtics
c    John Holland  Boston Celtics
d     R.J. Hunter  Boston Celtics
e   Jonas Jerebko  Boston Celtics
..            ...             ...
qk     Trey Lyles       Utah Jazz
ql   Shelvin Mack       Utah Jazz
qm      Raul Neto       Utah Jazz
qn   Tibor Pleiss       Utah Jazz
qo    Jeff Withey       Utah Jazz

[457 rows x 2 columns]

In [27]:
# loc örneği ile oyuncuların Name, Team ve Age getirelim
df.loc[:, ['Name', 'Team', 'Age']]

             Name            Team  Age
a   Avery Bradley  Boston Celtics   25
b     Jae Crowder  Boston Celtics   25
c    John Holland  Boston Celtics   27
d     R.J. Hunter  Boston Celtics   22
e   Jonas Jerebko  Boston Celtics   29
..            ...             ...  ...
qk     Trey Lyles       Utah Jazz   20
ql   Shelvin Mack       Utah Jazz   26
qm      Raul Neto       Utah Jazz   24
qn   Tibor Pleiss       Utah Jazz   26
qo    Jeff Withey       Utah Jazz   26

[457 rows x 3 columns]

In [28]:
# loc örneği ile ilk 20 satırdaki oyuncunun Name, Team ve Age getirelim
df.loc['a':'t', ['Name', 'Team', 'Age']]

                      Name            Team  Age
a            Avery Bradley  Boston Celtics   25
b              Jae Crowder  Boston Celtics   25
c             John Holland  Boston Celtics   27
d              R.J. Hunter  Boston Celtics   22
e            Jonas Jerebko  Boston Celtics   29
f             Amir Johnson  Boston Celtics   29
g            Jordan Mickey  Boston Celtics   21
h             Kelly Olynyk  Boston Celtics   25
i             Terry Rozier  Boston Celtics   22
j             Marcus Smart  Boston Celtics   22
k          Jared Sullinger  Boston Celtics   24
l            Isaiah Thomas  Boston Celtics   27
m              Evan Turner  Boston Celtics   27
n              James Young  Boston Celtics   20
o             Tyler Zeller  Boston Celtics   26
p         Bojan Bogdanovic   Brooklyn Nets   27
q             Markel Brown   Brooklyn Nets   24
r          Wayne Ellington   Brooklyn Nets   28
s  Rondae Hollis-Jefferson   Brooklyn Nets   21
t             Jarrett Jack   Brooklyn Nets   32

In [29]:
# loc örneği ile b ve ac satırdaki oyuncunun Name, Team ve Age getirelim
df.loc[['b','ac'], ['Name', 'Team', 'Age']]

            Name            Team  Age
b    Jae Crowder  Boston Celtics   25
ac  Donald Sloan   Brooklyn Nets   28

In [30]:
# loc örneği ile listedeki son 10 oyuncunun Age ve Salary gösterelim
df.loc[df.index[-10:], ['Age','Salary',]]

    Age      Salary
qf   23   1175880.0
qg   26  15409570.0
qh   23   1348440.0
qi   28   2050000.0
qj   26    981348.0
qk   20   2239800.0
ql   26   2433333.0
qm   24    900000.0
qn   26   2900000.0
qo   26    947276.0

In [31]:
#listedeki son 5 oyuncunun Name, Weight, College, Salary lerini gösterelim
df['College'] = df['College'].fillna('-') #College sütununda NaN olarak gelenleri verinin daha okunabilir olması için '-' imgesine çevirilir
df.loc[df.index[-10:], ['Name','Weight','College','Salary',]]

              Name  Weight   College      Salary
qf     Rudy Gobert     245         -   1175880.0
qg  Gordon Hayward     226    Butler  15409570.0
qh     Rodney Hood     206      Duke   1348440.0
qi      Joe Ingles     226         -   2050000.0
qj   Chris Johnson     206    Dayton    981348.0
qk      Trey Lyles     234  Kentucky   2239800.0
ql    Shelvin Mack     203    Butler   2433333.0
qm       Raul Neto     179         -    900000.0
qn    Tibor Pleiss     256         -   2900000.0
qo     Jeff Withey     231    Kansas    947276.0

In [32]:
# Loc örneği ile Utah Jazz da oynayan oyuncuları getirelim.
df.loc[df['Team'] == 'Utah Jazz']

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
qa,Trevor Booker,Utah Jazz,33,PF,28,8-Jun,228,Clemson,4775000.0
qb,Trey Burke,Utah Jazz,3,PG,23,1-Jun,191,Michigan,2658240.0
qc,Alec Burks,Utah Jazz,10,SG,24,6-Jun,214,Colorado,9463484.0
qd,Dante Exum,Utah Jazz,11,PG,20,6-Jun,190,-,3777720.0
qe,Derrick Favors,Utah Jazz,15,PF,24,10-Jun,265,Georgia Tech,12000000.0
qf,Rudy Gobert,Utah Jazz,27,C,23,1-Jul,245,-,1175880.0
qg,Gordon Hayward,Utah Jazz,20,SF,26,8-Jun,226,Butler,15409570.0
qh,Rodney Hood,Utah Jazz,5,SG,23,8-Jun,206,Duke,1348440.0
qi,Joe Ingles,Utah Jazz,2,SF,28,8-Jun,226,-,2050000.0
qj,Chris Johnson,Utah Jazz,23,SF,26,6-Jun,206,Dayton,981348.0
qk,Trey Lyles,Utah Jazz,41,PF,20,10-Jun,234,Kentucky,2239800.0
ql,Shelvin Mack,Utah Jazz,8,PG,26,3-Jun,203,Butler,2433333.0
qm,Raul Neto,Utah Jazz,25,PG,24,1-Jun,179,-,900000.0
qn,Tibor Pleiss,Utah Jazz,21,C,26,3-Jul,256,-,2900000.0
qo,Jeff Withey,Utah Jazz,24,C,26,Jul-00,231,Kansas,947276.0

In [33]:
# iloc örneği ile oyuncuların Name, Team, Number, Age, Height, Weight getirelim
df.iloc[:, [0,1,2,4,5,6]]

             Name            Team  Number  Age  Height  Weight
a   Avery Bradley  Boston Celtics       0   25   2-Jun     180
b     Jae Crowder  Boston Celtics      99   25   6-Jun     235
c    John Holland  Boston Celtics      30   27   5-Jun     205
d     R.J. Hunter  Boston Celtics      28   22   5-Jun     185
e   Jonas Jerebko  Boston Celtics       8   29  10-Jun     231
..            ...             ...     ...  ...     ...     ...
qk     Trey Lyles       Utah Jazz      41   20  10-Jun     234
ql   Shelvin Mack       Utah Jazz       8   26   3-Jun     203
qm      Raul Neto       Utah Jazz      25   24   1-Jun     179
qn   Tibor Pleiss       Utah Jazz      21   26   3-Jul     256
qo    Jeff Withey       Utah Jazz      24   26  Jul-00     231

[457 rows x 6 columns]

In [34]:
#iloc örneği ile Yaş olarak en geç olan ilk 5 oyuncuyu Name, Team, Age, Weight, Salary gösterelim
#en geç yaşa göre sıralama yapmak için öncelikle sort_values built_in function kullandık ve en genç yaşa göre getirmek için ascending=True kullandık ardından ilk 5 için head(5) kullandık
player = df.sort_values(by='Age', ascending=True).head(5) # ascending=False kullansaydık en yaşlı ilk 15 player getirirdik.
player.iloc[:,[0,1,4,6,8]]

                  Name                    Team  Age  Weight     Salary
hs       Rashad Vaughn         Milwaukee Bucks   19     202  1733040.0
ds        Devin Booker            Phoenix Suns   19     206  2127840.0
qk          Trey Lyles               Utah Jazz   20     234  2239800.0
pl     Cliff Alexander  Portland Trail Blazers   20     240   525093.0
ou  Karl-Anthony Towns  Minnesota Timberwolves   20     244  5703600.0

In [35]:
#iloc örneği ile En çok maaş alan ilk 15 oyuncuyu Name, Team, Position, Age, Salary gösterelim
#en çok maaş alan sıralama yapmak için öncelikle sort_values built_in function kullandık ve en çok maaş alan getirmek için ascending=False kullandık ardından ilk 15 için head(15) kullandık
player = df.sort_values(by='Salary', ascending=False).head(15) # ascending=True kullansaydık en az maaş ilk 15 player getirirdik.
player.iloc[:,[0,1,3,4,8]]

                 Name                   Team Position  Age      Salary
df        Kobe Bryant     Los Angeles Lakers       SF   37  25000000.0
fn       LeBron James    Cleveland Cavaliers       SF   31  22970500.0
ah    Carmelo Anthony        New York Knicks       SF   32  22875000.0
ir      Dwight Howard        Houston Rockets        C   30  22359364.0
mb         Chris Bosh             Miami Heat       PF   32  22192730.0
cw         Chris Paul   Los Angeles Clippers       PG   31  21468695.0
oy       Kevin Durant  Oklahoma City Thunder       SF   27  20158622.0
fi       Derrick Rose          Chicago Bulls       PG   27  20093064.0
ml        Dwyane Wade             Miami Heat       SG   34  20000000.0
fs         Kevin Love    Cleveland Cavaliers       PF   27  19689000.0
cu     DeAndre Jordan   Los Angeles Clippers        C   27  19689000.0
ki  LaMarcus Aldridge      San Antonio Spurs       PF   30  19689000.0
x         Brook Lopez          Brooklyn Nets        C   28  19689000.0
jf         Marc Gasol      Memphis Grizzlies        C   31  19688000.0
cs      Blake Griffin   Los Angeles Clippers       PF   27  18907726.0

In [36]:
# iloc örneği ile en çok kazanan ilk 5 SF oyuncuların 'Name', 'Team', 'Number',	'Position', 'Age', 'Weight', 'Salary' getirelim

top_pg_players  = df[df['Position'] == 'SF'].sort_values(by='Salary', ascending=False).head(5)
top_pg_players.iloc[:, [0,1,2,3,4,6,8]]

,Name,Team,Number,Position,Age,Weight,Salary
df,Kobe Bryant,Los Angeles Lakers,24,SF,37,212,25000000.0
fn,LeBron James,Cleveland Cavaliers,23,SF,31,250,22970500.0
ah,Carmelo Anthony,New York Knicks,7,SF,32,240,22875000.0
oy,Kevin Durant,Oklahoma City Thunder,35,SF,27,240,20158622.0
gr,Paul George,Indiana Pacers,13,SF,26,220,17120106.0

In [37]:
# iloc örneği ile en çok maaş alan 10 oyuncuyu, yaşlarına göre artandan azalana sıralayıp, sadece 'Name', 'Team', 'Position', 'Age', 'Salary' sütunlarını getirelim
# Tek satırda yazdık
player = df.sort_values(by='Salary', ascending=False).head(10).sort_values(by='Age', ascending=False)
player.iloc[:, [0, 1, 3, 4, 8]]

               Name                   Team Position  Age      Salary
df      Kobe Bryant     Los Angeles Lakers       SF   37  25000000.0
ml      Dwyane Wade             Miami Heat       SG   34  20000000.0
mb       Chris Bosh             Miami Heat       PF   32  22192730.0
ah  Carmelo Anthony        New York Knicks       SF   32  22875000.0
fn     LeBron James    Cleveland Cavaliers       SF   31  22970500.0
cw       Chris Paul   Los Angeles Clippers       PG   31  21468695.0
ir    Dwight Howard        Houston Rockets        C   30  22359364.0
oy     Kevin Durant  Oklahoma City Thunder       SF   27  20158622.0
fi     Derrick Rose          Chicago Bulls       PG   27  20093064.0
fs       Kevin Love    Cleveland Cavaliers       PF   27  19689000.0

In [38]:
# iloc örneği ile en çok maaş alan 10 oyuncuyu, yaşlarına göre artandan azalana sıralayıp, sadece 'Name', 'Team', 'Position', 'Age', 'Salary' sütunlarını getirelim
df_sorted = df.sort_values(by='Salary', ascending=False).head(10)
df_sorted = df_sorted.sort_values(by='Age', ascending=False)
df_sorted.iloc[:, [0, 1, 3, 4, 8]]

               Name                   Team Position  Age      Salary
df      Kobe Bryant     Los Angeles Lakers       SF   37  25000000.0
ml      Dwyane Wade             Miami Heat       SG   34  20000000.0
mb       Chris Bosh             Miami Heat       PF   32  22192730.0
ah  Carmelo Anthony        New York Knicks       SF   32  22875000.0
fn     LeBron James    Cleveland Cavaliers       SF   31  22970500.0
cw       Chris Paul   Los Angeles Clippers       PG   31  21468695.0
ir    Dwight Howard        Houston Rockets        C   30  22359364.0
oy     Kevin Durant  Oklahoma City Thunder       SF   27  20158622.0
fi     Derrick Rose          Chicago Bulls       PG   27  20093064.0
fs       Kevin Love    Cleveland Cavaliers       PF   27  19689000.0

In [39]:
# iloc ile Pozisyonu 'PG' (Point Guard) olan oyuncuları yaşa göre küçükten büyüğe sıralayıp, Name, Team, Age, Salary sütunlarını getirelim
pg_players = df[df['Position'] == 'PG'].sort_values(by='Age', ascending=True)
pg_players.iloc[:, [0, 1, 4, 8]]

                Name                    Team  Age     Salary
dm  D'Angelo Russell      Los Angeles Lakers   20  5103120.0
qd        Dante Exum               Utah Jazz   20  3777720.0
ol        Tyus Jones  Minnesota Timberwolves   20  1282080.0
od   Emmanuel Mudiay          Denver Nuggets   20  3102240.0
pg     Cameron Payne   Oklahoma City Thunder   21  2021520.0
..               ...                     ...  ...        ...
ai     Jose Calderon         New York Knicks   34  7402812.0
oe     Jameer Nelson          Denver Nuggets   34  4345000.0
gb       Steve Blake         Detroit Pistons   36  2170465.0
cy    Pablo Prigioni    Los Angeles Clippers   39   947726.0
ks      Andre Miller       San Antonio Spurs   40   250750.0

[92 rows x 4 columns]

In [40]:
# iloc ile  kilosu 100 kg’dan fazla olan oyuncuları, maaşlarına göre artandan azalana sıralayıp, Name, Weight, Salary, Team sütunlarını getirelim
heavy_players = df[df['Weight'] > 100].sort_values(by='Salary', ascending=False)
heavy_players.iloc[:, [0, 6, 8, 1]]

               Name  Weight      Salary                    Team
df      Kobe Bryant     212  25000000.0      Los Angeles Lakers
fn     LeBron James     250  22970500.0     Cleveland Cavaliers
ah  Carmelo Anthony     240  22875000.0         New York Knicks
ir    Dwight Howard     265  22359364.0         Houston Rockets
mb       Chris Bosh     235  22192730.0              Miami Heat
..              ...     ...         ...                     ...
jn   Alex Stepheson     270         NaN       Memphis Grizzlies
mm    Briante Weber     165         NaN              Miami Heat
mp    Dorell Wright     205         NaN              Miami Heat
oh     Axel Toupane     210         NaN          Denver Nuggets
ot       Greg Smith     250         NaN  Minnesota Timberwolves

[457 rows x 4 columns]